<script setup lang="ts">
import { ref, onMounted, watchEffect } from "vue";
import gsap from "gsap";
import { Back } from "gsap";
const content = ref();
const isVisible = ref(false);
const { title, paragraph1, paragraph2, subtitle } = {
  title: ref(null),
  paragraph1: ref(null),
  paragraph2: ref(null),
  subtitle: ref(null),
};
onMounted(() => {
  watchEffect(() => {
    if (isVisible.value) {
      animateText();
    }
  });
});


const dropdowns = ref([false, false, false]); // Массив для отслеживания состояния выпадающих меню

const toggleDropdown = (index: number) => {
  dropdowns.value[index] = !dropdowns.value[index];
	const textBlock = document.querySelector('.textBlock') as HTMLDivElement
	if(dropdowns.value[index]){
		const rect = hiddenBlock.children[0].getBoundingClientRect()
    	textBlock.style.height = rect.height + 'px'
    	textBlock.style.color = 'white'
    	textBlock.style.transition = 'height 1s, color 1s 0.3s'
	}
}
</script>
<template>
  <div class="bg-[#f8f8ff] pt-36">
    <h3 class="text-5xl text-center"><span class="text-[#7747ff]">Почему</span> мы?🤔</h3>
    <div class="wrapper w-full mt-36">

      <div class="dropDownMenus flex justify-center flex-col items-center">


        <div class="w-[550px]">
          <div
            class="flex justify-end items-center gap-8 bg-[#e3e3e3] p-2 rounded-t-xl"
						@click="toggleDropdown(0)"
          >
            <h2 class="text-[23px]">Достоинства низкой стоимости💸</h2>
            <img class="mr-3 w-8" src="/down.png" alt="" />
          </div>
          <div class="textBlock flex justify-center  bg-white p-5">
            <p class="text-[18px] font-[300] leading-[30px]">
              Доступность для широкого круга клиентов: Низкая стоимость делает
              товары более доступными для большего количества потребителей, что
              позволяет вашему магазину привлекать разнообразную аудиторию.
              Экономия денег для клиентов: Клиенты ценят возможность сэкономить
              деньги при покупке товаров. Низкие цены могут стать дополнительным
              стимулом для совершения покупок. Привлечение внимания: Магазины с
              низкими ценами могут привлечь больше внимания и привлечь больше
              потенциальных клиентов, особенно тех, кто ценит экономичные
              покупки.
            </p>
          </div>
        </div>
        <div class="w-[550px]">
          <div
            class="flex justify-end items-center gap-8 bg-[#e3e3e3] p-2 transition-all 1.2s"
						@click="toggleDropdown(1)"

          >
            <h2 class="text-[23px]">Достоинства низкой стоимости💸</h2>
            <img class="mr-3 w-8" src="/public/down.png" alt="" />
          </div>
          <div class="textBlock flex justify-center bg-white text-black overflow-hidden p-5 " >
            <p class="text-[18px] font-[300] leading-[30px]">
              Доступность для широкого круга клиентов: Низкая стоимость делает
              товары более доступными для большего количества потребителей, что
              позволяет вашему магазину привлекать разнообразную аудиторию.
              Экономия денег для клиентов: Клиенты ценят возможность сэкономить
              деньги при покупке товаров. Низкие цены могут стать дополнительным
              стимулом для совершения покупок. Привлечение внимания: Магазины с
              низкими ценами могут привлечь больше внимания и привлечь больше
              потенциальных клиентов, особенно тех, кто ценит экономичные
              покупки.
            </p>
          </div>
        </div>
        <div class="w-[550px]">
          <div
            class="flex justify-end items-center gap-8 bg-[#e3e3e3] p-2"
						@click="toggleDropdown(2)"
          >
            <h2 class="text-[23px]">Достоинства низкой стоимости💸</h2>
            <img class="mr-3 w-8" src="/public/down.png" alt="" />
          </div>
          <div class="textBlock flex justify-center bg-white p-5">
            <p class="text-[18px] font-[300] leading-[30px]">
              Доступность для широкого круга клиентов: Низкая стоимость делает
              товары более доступными для большего количества потребителей, что
              позволяет вашему магазину привлекать разнообразную аудиторию.
              Экономия денег для клиентов: Клиенты ценят возможность сэкономить
              деньги при покупке товаров. Низкие цены могут стать дополнительным
              стимулом для совершения покупок. Привлечение внимания: Магазины с
              низкими ценами могут привлечь больше внимания и привлечь больше
              потенциальных клиентов, особенно тех, кто ценит экономичные
              покупки.
            </p>
          </div>
        </div>


      </div>
    </div>
  </div>
</template>
<style>

</style>
